cf/Reports/РегистрРасчетАмортизацииОсновныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>РегистрРасчетАмортизацииОсновныхСредств</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизационнаяГруппа</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоОбъектам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf/InformationRegisters/ПервоначальныеСведенияОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСНалоговыйУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияДо2009</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодНачисленияАмортизации</Name>
					<Comment>Метод начисления амортизации в целях НУ (с 2009 г. не применяется)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыНачисленияАмортизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимостьНУ</Name>
					<Comment>Первоначальная стоимость для НУ (на 01.01.2002 или на момент ввода в эксплуатацию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДо2002</Name>
					<Comment>Первоначальная (вост.) стоимость до 01.01.2002 для НУ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияДо2002</Name>
					<Comment>Сумма амортизационных начислений до 01.01.2002 для НУ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокВключенияСтоимостиВСоставРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВключенияСтоимостиОСВСоставРасходовНУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийСрокИспользованияДо2009</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет</Name>
			<Comment>(Регл) Специальный коэффициент для амортизации (налоговый учет)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпециальныйКоэффициент</Name>
					<Comment>Значение специального коэффициента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/СостоянияОСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОСОрганизаций</Name>
			<Comment>(Регл) Регистр, который показывает изменение состояний основных по бух. учету ОС. Данные вносятся только документами. По этому регистру ведется анализ даты принятия к учету, ввода в эксплуатацию, выбытия.</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата установки состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение направлений амортизации по бух. учету</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособыОтраженияРасходовПоАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ПараметрыАмортизацииОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСНалоговыйУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентАмортизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПРДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/МетодыНачисленияАмортизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>МетодыНачисленияАмортизации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Линейный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нелинейный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕНАОФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Reports/РегистрРасчетАмортизацииОсновныхСредств/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

Перем ВидыРасходовПоСпособуАмортизации;
Перем CписокСчетов;
Перем ИтогСуммаАмортизации;
Перем СуммаАмортизацииПрямые экспорт;
Перем СуммаАмортизацииКосвенные Экспорт;
Перем СуммаАмортизацииПрочие Экспорт;
Перем СпособыРаспределенияРасходов Экспорт;

// Возвращает полное наименование элемента справочника, если у этого вида 
// справочников есть реквизит НаименованиеПолное.
// 
// Параметры:      
//    Элемент - элемент справочника, для которого нужно вернуть полное наименование
//
// Возвращаемое значение: 
//  Строка с полным наименованием.
//
Функция ПолноеНаименование(Элемент) Экспорт
 
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Возврат "";
 
	ИначеЕсли Элемент.Метаданные().Реквизиты.Найти("НаименованиеПолное") = Неопределено Тогда
		Возврат Элемент.Наименование;;

	ИначеЕсли НЕ ЗначениеЗаполнено(Элемент.НаименованиеПолное) Тогда
		Возврат Элемент.Наименование;

	Иначе
		Возврат Элемент.НаименованиеПолное;
	КонецЕсли;
 
КонецФункции

Процедура ВывестиСтроку(Опер, ДокументРезультат, Макет)
	
	Если Опер.Амортизация = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Строка1 = Макет.ПолучитьОбласть("Строка|Общая1");
	Строка2 = Макет.ПолучитьОбласть("Строка|Объект");
	Строка3 = Макет.ПолучитьОбласть("Строка|Общая2");
	
	Строка1.Параметры.ДатаОперации = Формат(Опер.ПериодДействия, "ДФ=dd.MM.yyyy");
	Строка3.Параметры.СпециальныйКоэффициент = Опер.СпециальныйКоэффициент;
	Строка3.Параметры.МетодНачисленияАмортизации = Опер.МетодНачисленияАмортизации;
	Строка2.Параметры.НаименованиеОбъекта = ПолноеНаименование(Опер.ОсновноеСредство);
	
	Если Опер.МетодНачисленияАмортизации = Перечисления.МетодыНачисленияАмортизации.Линейный Тогда
		Стоимость = Опер.ПервоначальнаяСтоимость;
		
	Иначе
		Стоимость = Опер.ОстаточнаяСтоимость;
	КонецЕсли;
	
	КоличествоМесяцевПолезногоИспользованияНаНач = 0;
	ДатаПринятияКУчету = Опер.ДатаПринятияКУчету;
	
	Если НЕ ЗначениеЗаполнено(ДатаПринятияКУчету) Тогда
		КоличествоМесяцевПолезногоИспользованияНаНач = ?(Опер.СрокПолезногоИспользования = NUll, 0, Опер.СрокПолезногоИспользования);
	Иначе
		ТекДата = КонецМесяца(ДобавитьМесяц(ДатаПринятияКУчету, 1));
		ТекДатаНач = КонецМесяца(Опер.ПериодДействия);
		Пока ТекДата < ТекДатаНач Цикл
			КоличествоМесяцевПолезногоИспользованияНаНач = КоличествоМесяцевПолезногоИспользованияНаНач + 1;
			ТекДата = КонецМесяца(ДобавитьМесяц(ТекДата, 1));
		КонецЦикла;
	КонецЕсли;
	
	Способ = СпособыРаспределенияРасходов.Найти(Опер.СпособОтраженияРасходов,"Способ");
	Если Способ=Неопределено тогда
		ПрочиеРасходы = Опер.Амортизация;
		ПрямыеРасходы = 0;
		КосвенныеРасходы = 0;
	Иначе
		БазисРаспределения = Новый Массив(3);
		БазисРаспределения[0] = Способ.ПрямыеЗатраты;
		БазисРаспределения[1] = Способ.КосвенныеЗатраты;
		БазисРаспределения[2] = Способ.ПрочиеЗатраты;
		Распределение = ОбщегоНазначения.РаспределитьПропорционально(Опер.Амортизация,БазисРаспределения);
		Если Распределение=Неопределено тогда
			ПрочиеРасходы = Опер.Амортизация;
			ПрямыеРасходы = 0;
			КосвенныеРасходы = 0;
		Иначе
			 ПрямыеРасходы	= Распределение[0];
			 КосвенныеРасходы	= Распределение[1];
			 ПрочиеРасходы	= Распределение[2];
		КонецЕсли;
	КонецЕсли;
	СуммаАмортизацииПрямые = СуммаАмортизацииПрямые + ПрямыеРасходы;
	СуммаАмортизацииКосвенные = СуммаАмортизацииКосвенные + КосвенныеРасходы;
	СуммаАмортизацииПрочие = СуммаАмортизацииПрочие + ПрочиеРасходы;
	
	
	Строка3.Параметры.Прямые	= ПрямыеРасходы;
	Строка3.Параметры.Косвенные	= КосвенныеРасходы;
	Строка3.Параметры.Прочие	= ПрочиеРасходы;
	
	Строка3.Параметры.Стоимость = Стоимость;
	Строка3.Параметры.ПолезныйСрок = макс(0,?(Опер.СрокПолезногоИспользования = NULL, 0, Опер.СрокПолезногоИспользования) - КоличествоМесяцевПолезногоИспользованияНаНач);
	Строка3.Параметры.СуммаАмортизации = ?(Опер.Амортизация = NULL, 0, Опер.Амортизация);

	ДокументРезультат.Вывести(Строка1);
	Если Не ГруппироватьПоОбъектам Тогда
		ДокументРезультат.Присоединить(Строка2);
	КонецЕсли;
	ДокументРезультат.Присоединить(Строка3);
	
	ИтогСуммаАмортизации = ИтогСуммаАмортизации + Опер.Амортизация;
	
КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт

	ДокументРезультат.Очистить();

	Макет = ПолучитьМакет("Отчет");

	Если ГруппироватьПоОбъектам Тогда
		Заголовок1 = Макет.ПолучитьОбласть("Заголовок|Общая1");
		Заголовок2 = Макет.ПолучитьОбласть("Заголовок|Общая2");
		
	Иначе
		Заголовок1 = Макет.ПолучитьОбласть("Заголовок");
	КонецЕсли;
	
	Заголовок1.Параметры.НачалоПериода       = Формат(ДатаНач, "ДФ=dd.MM.yyyy");
	Заголовок1.Параметры.КонецПериода        = Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация);
	НазваниеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
	Заголовок1.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	Заголовок1.Параметры.ИННОрганизации      = "" + Организация.ИНН + "/" + Организация.КПП;
	Заголовок1.Параметры.НазваниеАмортизационнойГруппы = ?(НЕ ЗначениеЗаполнено(АмортизационнаяГруппа), "по всем", АмортизационнаяГруппа);
	
	Если ГруппироватьПоОбъектам Тогда
		ДокументРезультат.Вывести(Заголовок1);
		ДокументРезультат.Присоединить(Заголовок2);
		
	Иначе
		ДокументРезультат.Вывести(Заголовок1);
	КонецЕсли;

	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	// Проверим заполнение обязательных реквизитов
	Если НалоговыйУчет.ПроверитьЗаполнениеОбязательныхРеквизитов(ДатаНач,ДатаКон,Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;
	
	СуммаАмортизацииПрямые = 0;
	СуммаАмортизацииКосвенные = 0;
	СуммаАмортизацииПрочие = 0;
	// Шапка
	Если ГруппироватьПоОбъектам Тогда

		Шапка1 = Макет.ПолучитьОбласть("Шапка|Общая1");
		Шапка2 = Макет.ПолучитьОбласть("Шапка|Общая2");
		Шапка2.Параметры.НК2 = 2;
		Шапка2.Параметры.НК3 = 3;
		Шапка2.Параметры.НК4 = 4;
		Шапка2.Параметры.НК5 = 5;
		Шапка2.Параметры.НК6 = 6;

		ДокументРезультат.Вывести(Шапка1);
		ДокументРезультат.Присоединить(Шапка2);

	Иначе
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.НК2 = 3;
		Шапка.Параметры.НК3 = 4;
		Шапка.Параметры.НК4 = 5;
		Шапка.Параметры.НК5 = 6;
		Шапка.Параметры.НК6 = 7;
		ДокументРезультат.Вывести(Шапка);
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НалоговыйОбороты.Регистратор,
	|	НалоговыйОбороты.СуммаНУОборотКт,
	|	НалоговыйОбороты.Период,
	|	НалоговыйОбороты.Субконто1 КАК ОсновноеСредство
	|ПОМЕСТИТЬ ХозрасчетныйОбороты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			регистратор,
	|			Счет В ИЕРАРХИИ (&Счет02)
	|				И (НЕ Счет = &Счет09),
	|			&ВидСубконто,
	|			Организация = &Организация
	|				И &АмортизационнаяГруппа
	|				И КорСубконто1.ВидРасходовНУ = &Амортизация,
	|			,
	|			&ВидКорСубконто) КАК НалоговыйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.ОсновноеСредство,
	|	ХозрасчетныйОбороты.Период,
	|	МАКСИМУМ(ПервоначальныеСведения.Период) КАК Период1,
	|	МАКСИМУМ(ПервоначальныеСведения.МетодНачисленияАмортизации) КАК МетодНачисленияАмортизации,
	|	МАКСИМУМ(ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ) КАК ПервоначальнаяСтоимостьНУ,
	|	МАКСИМУМ(ПервоначальныеСведения.АмортизацияДо2009) КАК АмортизацияДо2009,
	|	МАКСИМУМ(ПервоначальныеСведения.ФактическийСрокИспользованияДо2009) КАК ФактическийСрокИспользованияДо2009
	|ПОМЕСТИТЬ ПервоначальныеСведения
	|ИЗ
	|	ХозрасчетныйОбороты КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведения
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, МЕСЯЦ) > ПервоначальныеСведения.Период)
	|			И ХозрасчетныйОбороты.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство
	|ГДЕ
	|	ПервоначальныеСведения.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОсновныеСредстваНеЛин
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	(ОсновныеСредства.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	|				И ОсновныеСредства.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	|			ИЛИ ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОСПриПереходеКЛинейномуМетоду.Субконто1,
	|	АмортизацияОСПриПереходеКЛинейномуМетоду.СуммаНУОстаток
	|ПОМЕСТИТЬ АмортизацияОСПриПереходеКЛинейномуМетоду
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаПереходаКЛинейномуМетоду,
	|			Счет В ИЕРАРХИИ (&Счет01)
	|				И (НЕ Счет = &Счет09),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|			Организация = &Организация
	|				И (НЕ Субконто1 В
	|						(ВЫБРАТЬ
	|							ОсновныеСредстваНеЛин.Ссылка
	|						ИЗ
	|							ОсновныеСредстваНеЛин))
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ПервоначальныеСведения.ОсновноеСредство
	|					ИЗ
	|						ПервоначальныеСведения)) КАК АмортизацияОСПриПереходеКЛинейномуМетоду
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.ОсновноеСредство,
	|	ХозрасчетныйОбороты.Период,
	|	МАКСИМУМ(Коэффициент.Период) КАК Период1,
	|	МАКСИМУМ(Коэффициент.СпециальныйКоэффициент) КАК СпециальныйКоэффициент
	|ПОМЕСТИТЬ Коэффициент
	|ИЗ
	|	ХозрасчетныйОбороты КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет КАК Коэффициент
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, МЕСЯЦ) > Коэффициент.Период)
	|			И ХозрасчетныйОбороты.ОсновноеСредство = Коэффициент.ОсновноеСредство
	|ГДЕ
	|	Коэффициент.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.ОсновноеСредство,
	|	ХозрасчетныйОбороты.Период,
	|	МИНИМУМ(СостояниеОС.ДатаСостояния) КАК ДатаСостояния
	|ПОМЕСТИТЬ СостояниеОС
	|ИЗ
	|	ХозрасчетныйОбороты КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостояниеОС
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, МЕСЯЦ) > СостояниеОС.ДатаСостояния)
	|			И ХозрасчетныйОбороты.ОсновноеСредство = СостояниеОС.ОсновноеСредство
	|ГДЕ
	|	СостояниеОС.Организация = &Организация
	|	И СостояниеОС.Состояние = &ПринятоКУчету
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.ОсновноеСредство,
	|	ХозрасчетныйОбороты.Период,
	|	МАКСИМУМ(СпособОтражения.Период) КАК Период1,
	|	МАКСИМУМ(СпособОтражения.СпособыОтраженияРасходовПоАмортизации) КАК СпособыОтраженияРасходовПоАмортизации
	|ПОМЕСТИТЬ СпособОтражения
	|ИЗ
	|	ХозрасчетныйОбороты КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособОтражения
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, МЕСЯЦ) > СпособОтражения.Период)
	|			И ХозрасчетныйОбороты.ОсновноеСредство = СпособОтражения.ОсновноеСредство
	|ГДЕ
	|	СпособОтражения.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.ОсновноеСредство,
	|	ХозрасчетныйОбороты.Период,
	|	МАКСИМУМ(Параметры.Период) КАК Период1,
	|	МАКСИМУМ(Параметры.СрокПолезногоИспользования) КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ Параметры
	|ИЗ
	|	ХозрасчетныйОбороты КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет КАК Параметры
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, МЕСЯЦ) > Параметры.Период)
	|			И ХозрасчетныйОбороты.ОсновноеСредство = Параметры.ОсновноеСредство
	|ГДЕ
	|	Параметры.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Период,
	|	МАКСИМУМ(УчетнаяПолитикаОрганизаций.МетодНачисленияАмортизацииНУ) КАК МетодНачисленияАмортизацииНУ
	|ПОМЕСТИТЬ УчетнаяПолитикаОрганизаций
	|ИЗ
	|	ХозрасчетныйОбороты КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, МЕСЯЦ) >= УчетнаяПолитикаОрганизаций.Период)
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалоговыйОстаткиИОбороты.Регистратор КАК регистратор,
	|	НалоговыйОстаткиИОбороты.Субконто1 КАК ОсновноеСредство,
	|	НалоговыйОстаткиИОбороты.СуммаНУНачальныйОстатокДт,
	|	НалоговыйОстаткиИОбороты.СуммаНУНачальныйОстаток
	|ПОМЕСТИТЬ НалоговыйОстаткиИОбороты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			регистратор,
	|			,
	|			Счет В ИЕРАРХИИ (&Счет01)
	|				И (НЕ Счет = &Счет09),
	|			&ВидСубконто,
	|			Организация = &Организация) КАК НалоговыйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалоговыйОбороты.Регистратор,
	|	НалоговыйОбороты.СуммаНУОборотКт,
	|	НалоговыйОбороты.Период,
	|	НалоговыйОбороты.Субконто1 КАК ОсновноеСредство
	|ПОМЕСТИТЬ ХозрасчетныйОбороты2
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			регистратор,
	|			Счет В ИЕРАРХИИ (&Счет02)
	|				И (НЕ Счет = &Счет09),
	|			&ВидСубконто,
	|			Организация = &Организация
	|				И &АмортизационнаяГруппа,
	|			,
	|			&ВидКорСубконто91) КАК НалоговыйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты2.ОсновноеСредство,
	|	ХозрасчетныйОбороты2.Период,
	|	МАКСИМУМ(ПервоначальныеСведения.Период) КАК Период1,
	|	МАКСИМУМ(ПервоначальныеСведения.МетодНачисленияАмортизации) КАК МетодНачисленияАмортизации,
	|	МАКСИМУМ(ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ) КАК ПервоначальнаяСтоимостьНУ,
	|	МАКСИМУМ(ПервоначальныеСведения.АмортизацияДо2009) КАК АмортизацияДо2009,
	|	МАКСИМУМ(ПервоначальныеСведения.ФактическийСрокИспользованияДо2009) КАК ФактическийСрокИспользованияДо2009
	|ПОМЕСТИТЬ ПервоначальныеСведения2
	|ИЗ
	|	ХозрасчетныйОбороты2 КАК ХозрасчетныйОбороты2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведения
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты2.Период, МЕСЯЦ) > ПервоначальныеСведения.Период)
	|			И ХозрасчетныйОбороты2.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство
	|ГДЕ
	|	ПервоначальныеСведения.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты2.Период,
	|	ХозрасчетныйОбороты2.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОСПриПереходеКЛинейномуМетоду.Субконто1,
	|	АмортизацияОСПриПереходеКЛинейномуМетоду.СуммаНУОстаток
	|ПОМЕСТИТЬ АмортизацияОСПриПереходеКЛинейномуМетоду2
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаПереходаКЛинейномуМетоду,
	|			Счет В ИЕРАРХИИ (&Счет01)
	|				И (НЕ Счет = &Счет09),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|			Организация = &Организация
	|				И (НЕ Субконто1 В
	|						(ВЫБРАТЬ
	|							ОсновныеСредстваНеЛин.Ссылка
	|						ИЗ
	|							ОсновныеСредстваНеЛин))
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ПервоначальныеСведения2.ОсновноеСредство
	|					ИЗ
	|						ПервоначальныеСведения2)) КАК АмортизацияОСПриПереходеКЛинейномуМетоду
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты2.ОсновноеСредство,
	|	ХозрасчетныйОбороты2.Период,
	|	МАКСИМУМ(Коэффициент.Период) КАК Период1,
	|	МАКСИМУМ(Коэффициент.СпециальныйКоэффициент) КАК СпециальныйКоэффициент
	|ПОМЕСТИТЬ Коэффициент2
	|ИЗ
	|	ХозрасчетныйОбороты2 КАК ХозрасчетныйОбороты2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет КАК Коэффициент
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты2.Период, МЕСЯЦ) > Коэффициент.Период)
	|			И ХозрасчетныйОбороты2.ОсновноеСредство = Коэффициент.ОсновноеСредство
	|ГДЕ
	|	Коэффициент.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты2.Период,
	|	ХозрасчетныйОбороты2.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты2.ОсновноеСредство,
	|	ХозрасчетныйОбороты2.Период,
	|	МИНИМУМ(СостояниеОС.ДатаСостояния) КАК ДатаСостояния
	|ПОМЕСТИТЬ СостояниеОС2
	|ИЗ
	|	ХозрасчетныйОбороты2 КАК ХозрасчетныйОбороты2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостояниеОС
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты2.Период, МЕСЯЦ) > СостояниеОС.ДатаСостояния)
	|			И ХозрасчетныйОбороты2.ОсновноеСредство = СостояниеОС.ОсновноеСредство
	|ГДЕ
	|	СостояниеОС.Организация = &Организация
	|	И СостояниеОС.Состояние = &ПринятоКУчету
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты2.Период,
	|	ХозрасчетныйОбороты2.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты2.ОсновноеСредство,
	|	ХозрасчетныйОбороты2.Период,
	|	МАКСИМУМ(СпособОтражения.Период) КАК Период1,
	|	МАКСИМУМ(СпособОтражения.СпособыОтраженияРасходовПоАмортизации) КАК СпособыОтраженияРасходовПоАмортизации
	|ПОМЕСТИТЬ СпособОтражения2
	|ИЗ
	|	ХозрасчетныйОбороты2 КАК ХозрасчетныйОбороты2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособОтражения
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты2.Период, МЕСЯЦ) > СпособОтражения.Период)
	|			И ХозрасчетныйОбороты2.ОсновноеСредство = СпособОтражения.ОсновноеСредство
	|ГДЕ
	|	СпособОтражения.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты2.Период,
	|	ХозрасчетныйОбороты2.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты2.ОсновноеСредство,
	|	ХозрасчетныйОбороты2.Период,
	|	МАКСИМУМ(Параметры.Период) КАК Период1,
	|	МАКСИМУМ(Параметры.СрокПолезногоИспользования) КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ Параметры2
	|ИЗ
	|	ХозрасчетныйОбороты2 КАК ХозрасчетныйОбороты2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет КАК Параметры
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты2.Период, МЕСЯЦ) > Параметры.Период)
	|			И ХозрасчетныйОбороты2.ОсновноеСредство = Параметры.ОсновноеСредство
	|ГДЕ
	|	Параметры.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты2.Период,
	|	ХозрасчетныйОбороты2.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты2.Период,
	|	МАКСИМУМ(УчетнаяПолитикаОрганизаций.МетодНачисленияАмортизацииНУ) КАК МетодНачисленияАмортизацииНУ
	|ПОМЕСТИТЬ УчетнаяПолитикаОрганизаций2
	|ИЗ
	|	ХозрасчетныйОбороты2 КАК ХозрасчетныйОбороты2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО (НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты2.Период, МЕСЯЦ) >= УчетнаяПолитикаОрганизаций.Период)
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты2.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаАмортизации.СуммаНУОборотКт, 0) КАК Амортизация,
	|	ТаблицаАмортизации.Период КАК ПериодДействия,
	|	ВЫБОР
	|		КОГДА ТаблицаАмортизации.ОсновноеСредство.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	|					И ТаблицаАмортизации.ОсновноеСредство.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	|				ИЛИ ТаблицаАмортизации.ОсновноеСредство.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|		ИНАЧЕ УчетнаяПолитикаОрганизаций.МетодНачисленияАмортизацииНУ
	|	КОНЕЦ КАК МетодНачисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ, 0) - ЕСТЬNULL(ПервоначальныеСведения.АмортизацияДо2009, 0)
	|		ИНАЧЕ ЕСТЬNULL(АмортизацияОСПриПереходеКЛинейномуМетоду.СуммаНУОстаток, ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ)
	|	КОНЕЦ КАК ПервоначальнаяСтоимость,
	|	Коэффициент.СпециальныйКоэффициент,
	|	ВЫБОР
	|		КОГДА СостояниеОС.ДатаСостояния < &ДатаНачалаНУ
	|			ТОГДА &ДатаНачалаНУ
	|		ИНАЧЕ СостояниеОС.ДатаСостояния
	|	КОНЕЦ КАК ДатаПринятияКУчету,
	|	СпособОтражения.СпособыОтраженияРасходовПоАмортизации КАК СпособОтраженияРасходов,
	|	ТаблицаАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009
	|			ТОГДА ЕСТЬNULL(Параметры.СрокПолезногоИспользования, 0) - ЕСТЬNULL(ПервоначальныеСведения.ФактическийСрокИспользованияДо2009, 0)
	|		ИНАЧЕ ЕСТЬNULL(Параметры.СрокПолезногоИспользования, 0)
	|	КОНЕЦ КАК СрокПолезногоИспользования,
	|	НалоговыйОстаткиИОбороты.СуммаНУНачальныйОстатокДт КАК ПервоначальнаяСтоимостьДляАмортизации,
	|	НалоговыйОстаткиИОбороты.СуммаНУНачальныйОстаток КАК ОстаточнаяСтоимость
	|ПОМЕСТИТЬ РегистрАмортизацииОС
	|ИЗ
	|	ХозрасчетныйОбороты КАК ТаблицаАмортизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведения КАК ПервоначальныеСведения
	|		ПО ТаблицаАмортизации.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = ПервоначальныеСведения.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОСПриПереходеКЛинейномуМетоду КАК АмортизацияОСПриПереходеКЛинейномуМетоду
	|		ПО (ПервоначальныеСведения.ОсновноеСредство = АмортизацияОСПриПереходеКЛинейномуМетоду.Субконто1)
	|			И ((НЕ ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Коэффициент КАК Коэффициент
	|		ПО ТаблицаАмортизации.ОсновноеСредство = Коэффициент.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = Коэффициент.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеОС КАК СостояниеОС
	|		ПО ТаблицаАмортизации.ОсновноеСредство = СостояниеОС.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = СостояниеОС.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособОтражения КАК СпособОтражения
	|		ПО ТаблицаАмортизации.ОсновноеСредство = СпособОтражения.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = СпособОтражения.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Параметры КАК Параметры
	|		ПО ТаблицаАмортизации.ОсновноеСредство = Параметры.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = Параметры.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО ТаблицаАмортизации.Период = УчетнаяПолитикаОрганизаций.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ НалоговыйОстаткиИОбороты КАК НалоговыйОстаткиИОбороты
	|		ПО ТаблицаАмортизации.ОсновноеСредство = НалоговыйОстаткиИОбороты.ОсновноеСредство
	|			И ТаблицаАмортизации.Регистратор = НалоговыйОстаткиИОбороты.регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ТаблицаАмортизации.СуммаНУОборотКт, 0),
	|	ТаблицаАмортизации.Период,
	|	ВЫБОР
	|		КОГДА ТаблицаАмортизации.ОсновноеСредство.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	|					И ТаблицаАмортизации.ОсновноеСредство.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	|				ИЛИ ТаблицаАмортизации.ОсновноеСредство.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|		ИНАЧЕ УчетнаяПолитикаОрганизаций.МетодНачисленияАмортизацииНУ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ, 0) - ЕСТЬNULL(ПервоначальныеСведения.АмортизацияДо2009, 0)
	|		ИНАЧЕ ЕСТЬNULL(АмортизацияОСПриПереходеКЛинейномуМетоду.СуммаНУОстаток, ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ)
	|	КОНЕЦ,
	|	Коэффициент.СпециальныйКоэффициент,
	|	ВЫБОР
	|		КОГДА СостояниеОС.ДатаСостояния < &ДатаНачалаНУ
	|			ТОГДА &ДатаНачалаНУ
	|		ИНАЧЕ СостояниеОС.ДатаСостояния
	|	КОНЕЦ,
	|	СпособОтражения.СпособыОтраженияРасходовПоАмортизации,
	|	ТаблицаАмортизации.ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009
	|			ТОГДА ЕСТЬNULL(Параметры.СрокПолезногоИспользования, 0) - ЕСТЬNULL(ПервоначальныеСведения.ФактическийСрокИспользованияДо2009, 0)
	|		ИНАЧЕ ЕСТЬNULL(Параметры.СрокПолезногоИспользования, 0)
	|	КОНЕЦ,
	|	НалоговыйОстаткиИОбороты.СуммаНУНачальныйОстатокДт,
	|	НалоговыйОстаткиИОбороты.СуммаНУНачальныйОстаток
	|ИЗ
	|	ХозрасчетныйОбороты2 КАК ТаблицаАмортизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведения2 КАК ПервоначальныеСведения
	|		ПО ТаблицаАмортизации.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = ПервоначальныеСведения.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОСПриПереходеКЛинейномуМетоду2 КАК АмортизацияОСПриПереходеКЛинейномуМетоду
	|		ПО (ПервоначальныеСведения.ОсновноеСредство = АмортизацияОСПриПереходеКЛинейномуМетоду.Субконто1)
	|			И ((НЕ ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Коэффициент2 КАК Коэффициент
	|		ПО ТаблицаАмортизации.ОсновноеСредство = Коэффициент.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = Коэффициент.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеОС2 КАК СостояниеОС
	|		ПО ТаблицаАмортизации.ОсновноеСредство = СостояниеОС.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = СостояниеОС.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособОтражения2 КАК СпособОтражения
	|		ПО ТаблицаАмортизации.ОсновноеСредство = СпособОтражения.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = СпособОтражения.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Параметры2 КАК Параметры
	|		ПО ТаблицаАмортизации.ОсновноеСредство = Параметры.ОсновноеСредство
	|			И ТаблицаАмортизации.Период = Параметры.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаОрганизаций2 КАК УчетнаяПолитикаОрганизаций
	|		ПО ТаблицаАмортизации.Период = УчетнаяПолитикаОрганизаций.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ НалоговыйОстаткиИОбороты КАК НалоговыйОстаткиИОбороты
	|		ПО ТаблицаАмортизации.ОсновноеСредство = НалоговыйОстаткиИОбороты.ОсновноеСредство
	|			И ТаблицаАмортизации.Регистратор = НалоговыйОстаткиИОбороты.регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрАмортизацииОС.ПериодДействия,
	|	МАКСИМУМ(УчетнаяПолитикаОрганизаций.Период) КАК ПериодСреза
	|ПОМЕСТИТЬ УчетнаяПолитикаОрганизацийСрезПоследнихПериодовОС
	|ИЗ
	|	РегистрАмортизацииОС КАК РегистрАмортизацииОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО РегистрАмортизацииОС.ПериодДействия >= УчетнаяПолитикаОрганизаций.Период
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ДатаКон = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УчетнаяПолитикаОрганизаций.Период < &ДатаКон
	|		КОНЕЦ
	|	И УчетнаяПолитикаОрганизаций.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрАмортизацииОС.ПериодДействия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетнаяПолитикаОрганизацийСрезПоследнихПериодовОС.ПериодДействия,
	|	УчетнаяПолитикаОрганизаций.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ
	|ПОМЕСТИТЬ УчетнаяПолитикаОрганизацийСрезПоследнихОС
	|ИЗ
	|	УчетнаяПолитикаОрганизацийСрезПоследнихПериодовОС КАК УчетнаяПолитикаОрганизацийСрезПоследнихПериодовОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО УчетнаяПолитикаОрганизацийСрезПоследнихПериодовОС.ПериодСреза = УчетнаяПолитикаОрганизаций.Период
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ДатаКон = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УчетнаяПолитикаОрганизаций.Период < &ДатаКон
	|		КОНЕЦ
	|	И УчетнаяПолитикаОрганизаций.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрАмортизацииОС.Амортизация КАК Амортизация,
	|	РегистрАмортизацииОС.ПериодДействия КАК ПериодДействия,
	|	РегистрАмортизацииОС.МетодНачисленияАмортизации,
	|	РегистрАмортизацииОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	РегистрАмортизацииОС.СпециальныйКоэффициент,
	|	РегистрАмортизацииОС.ДатаПринятияКУчету,
	|	РегистрАмортизацииОС.СпособОтраженияРасходов,
	|	РегистрАмортизацииОС.ОсновноеСредство,
	|	РегистрАмортизацииОС.СрокПолезногоИспользования,
	|	РегистрАмортизацииОС.ПервоначальнаяСтоимостьДляАмортизации КАК ПервоначальнаяСтоимостьДляАмортизации,
	|	РегистрАмортизацииОС.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость
	|ИЗ
	|	РегистрАмортизацииОС КАК РегистрАмортизацииОС
	|ГДЕ
	|	(РегистрАмортизацииОС.ОсновноеСредство.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	|				И РегистрАмортизацииОС.ОсновноеСредство.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	|			ИЛИ РегистрАмортизацииОС.ОсновноеСредство.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа)
	|			ИЛИ (НЕ РегистрАмортизацииОС.ПериодДействия В
	|					(ВЫБРАТЬ
	|						УчетнаяПолитикаОрганизацийСрезПоследнихОС.ПериодДействия
	|					ИЗ
	|						УчетнаяПолитикаОрганизацийСрезПоследнихОС
	|					ГДЕ
	|						УчетнаяПолитикаОрганизацийСрезПоследнихОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный))))
	|ИТОГИ
	|	СУММА(Амортизация),
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(ПервоначальнаяСтоимостьДляАмортизации),
	|	СУММА(ОстаточнаяСтоимость)
	|ПО ПериодДействия
	|";

	
		Если ГруппироватьПоОбъектам Тогда
			 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПО ПериодДействия", "ПО ОсновноеСредство,ПериодДействия");
		 КонецЕсли;
		 
	Если Не АмортизационнаяГруппа.Пустая() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &АмортизационнаяГруппа", "И Субконто1.АмортизационнаяГруппа = &АмортизационнаяГруппа");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &АмортизационнаяГруппа", "");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",     Организация);
	Запрос.УстановитьПараметр("ДатаНач",         ?(НЕ ЗначениеЗаполнено(ДатаНач),ДатаНач,НачалоДня(ДатаНач)));
	Запрос.УстановитьПараметр("ДатаКон",         ?(НЕ ЗначениеЗаполнено(ДатаКон),ДатаКон,КонецДня(ДатаКон)));
	Запрос.УстановитьПараметр("ПринятоКУчету", 	 Перечисления.СостоянияОС.ПринятоКУчету);
	Запрос.УстановитьПараметр("ДатаНачалаНУ",    '20020101000000');
	Запрос.УстановитьПараметр("ДатаПереходаКЛинейномуМетоду", УправлениеВнеоборотнымиАктивами.ПолучитьДатуПереходаКЛинейномуМетоду(ДатаНач, Организация));
	Массив = Новый Массив;
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
	Запрос.УстановитьПараметр("Счет",Массив);
	Массив = Новый Массив;
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
	Массив.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
	Запрос.УстановитьПараметр("Счет01",Массив);
	Запрос.УстановитьПараметр("Счет02",ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
	Запрос.УстановитьПараметр("Счет09",ПланыСчетов.Хозрасчетный.ВыбытиеОС);
	Запрос.УстановитьПараметр("ВидСубконто",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
    Запрос.УстановитьПараметр("ВидКорСубконто",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
    Запрос.УстановитьПараметр("ВидКорСубконто91",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
	Запрос.УстановитьПараметр("Амортизация",Перечисления.ВидыРасходовНУ.Амортизация);
	Запрос.УстановитьПараметр("АмортизационнаяГруппа",АмортизационнаяГруппа);
	
	Запрос.Текст = ТекстЗапроса;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Организация", Организация);
	
	ИтогСуммаАмортизации = 0;
	
	Опер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаспределениеАмортизации.ТекущееНаправление КАК Способ,
		|	СУММА(РаспределениеАмортизации.БазаРаспределения) КАК БазаРаспределения,
		|	СУММА(РаспределениеАмортизации.ПрямыеЗатраты) КАК ПрямыеЗатраты,
		|	СУММА(РаспределениеАмортизации.КосвенныеЗатраты) КАК КосвенныеЗатраты,
		|	СУММА(РаспределениеАмортизации.ПрочиеЗатраты) КАК ПрочиеЗатраты
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
		|	ИЗ
		|		РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет
		|	ГДЕ
		|		СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет.Организация = &Организация
		|		И СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет.Период > &ДатаНач
		|		И СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет.Период <= &ДатаКон
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет.СпособыОтраженияРасходовПоАмортизации
		|	ИЗ
		|		РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаНач, Организация = &Организация) КАК СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет) КАК СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НаправлениеНачисленияАмортизацииНаправления.Коэффициент КАК БазаРаспределения,
		|			ВЫБОР
		|				КОГДА НаправлениеНачисленияАмортизацииНаправления.СчетЗатрат В ИЕРАРХИИ (&СчетПрочихЗатрат)
		|					ТОГДА НаправлениеНачисленияАмортизацииНаправления.Коэффициент
		|				ИНАЧЕ 0 КОНЕЦ КАК ПрочиеЗатраты,
		|			ВЫБОР
		|				КОГДА (НЕ НаправлениеНачисленияАмортизацииНаправления.СчетЗатрат В ИЕРАРХИИ (&СчетРасходыНаПродажу)) И 
		|					  (ЕСТЬNULL(Правила.ВидЗатратНУ, 0) <> 0)
		|					ТОГДА НаправлениеНачисленияАмортизацииНаправления.Коэффициент
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеЗатраты,
		|			ВЫБОР
		|				КОГДА (НЕ НаправлениеНачисленияАмортизацииНаправления.СчетЗатрат В ИЕРАРХИИ (&СчетПрочихЗатрат)) И
		|				      (НаправлениеНачисленияАмортизацииНаправления.СчетЗатрат В ИЕРАРХИИ (&СчетРасходыНаПродажу) ИЛИ
		|					  ЕСТЬNULL(Правила.ВидЗатратНУ, 0) = 0)
		|					ТОГДА НаправлениеНачисленияАмортизацииНаправления.Коэффициент
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеЗатраты,
		|			НаправлениеНачисленияАмортизации.Ссылка КАК ТекущееНаправление,
		|			НаправлениеНачисленияАмортизации.Представление КАК Представление
		|		ИЗ
		|			(ВЫБРАТЬ
		|				Направления.Ссылка КАК Ссылка,
		|				Направления.Коэффициент КАК Коэффициент,
		|				Направления.СчетЗатрат КАК СчетЗатрат,
		|				Направления.ПодразделениеОрганизации КАК Подразделение,
		|				ВЫБОР 
		|					КОГДА Направления.Субконто1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Направления.Субконто1
		|					КОГДА Направления.Субконто2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Направления.Субконто2
		|					КОГДА Направления.Субконто3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Направления.Субконто3
		|               ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК СтатьяЗатрат,
		|				ВЫБОР 
		|					КОГДА Направления.Субконто1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Направления.Субконто1.ВидРасходовНУ
		|					КОГДА Направления.Субконто2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Направления.Субконто2.ВидРасходовНУ
		|					КОГДА Направления.Субконто3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Направления.Субконто3.ВидРасходовНУ
		|               ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК ВидРасходовНУ
		|			ИЗ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК Направления) КАК НаправлениеНачисленияАмортизацииНаправления
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации КАК НаправлениеНачисленияАмортизации
		|				ПО НаправлениеНачисленияАмортизацииНаправления.Ссылка = НаправлениеНачисленияАмортизации.Ссылка
		|               ЛЕВОЕ СОЕДИНЕНИЕ СписокПрямыхРасходовНУ КАК Правила
		|				ПО (Правила.ВидЗатратНУ = НаправлениеНачисленияАмортизацииНаправления.ВидРасходовНУ) И 
		|					(Правила.Подразделение = НЕОПРЕДЕЛЕНО ИЛИ Правила.Подразделение = НаправлениеНачисленияАмортизацииНаправления.Подразделение) И 
		|					(Правила.СчетЗатрат = НЕОПРЕДЕЛЕНО ИЛИ Правила.СчетЗатрат = НаправлениеНачисленияАмортизацииНаправления.СчетЗатрат) И
		|					(Правила.КорСчетЗатрат = НЕОПРЕДЕЛЕНО ИЛИ Правила.КорСчетЗатрат В ИЕРАРХИИ (&СчетАмортизации)) И
		|					(Правила.СтатьяЗатрат = НЕОПРЕДЕЛЕНО ИЛИ Правила.СтатьяЗатрат = НаправлениеНачисленияАмортизацииНаправления.СтатьяЗатрат)
		|				) КАК РаспределениеАмортизации
		|		ПО СпособыОтраженияРасходовПоАмортизацииНалоговыйУчет.СпособыОтраженияРасходовПоАмортизации = РаспределениеАмортизации.ТекущееНаправление
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеАмортизации.ТекущееНаправление";
		Запрос.УстановитьПараметр("СчетПрочихЗатрат", ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
		Запрос.УстановитьПараметр("СчетРасходыНаПродажу", ПланыСчетов.Хозрасчетный.РасходыНаПродажу);
		Запрос.УстановитьПараметр("СчетАмортизации", ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
		Запрос.МенеджерВременныхТаблиц = НалоговыйУчет.СписокПрямыхРасходовНУ(Организация, ДатаНач, ДатаКон);
		СпособыРаспределенияРасходов = Запрос.Выполнить().Выгрузить();
		СпособыРаспределенияРасходов.Индексы.Добавить("Способ");
		
		Пока Опер.Следующий() Цикл
			
			Если ГруппироватьПоОбъектам Тогда
				
				Группировка1 = Макет.ПолучитьОбласть("Группировка|Общая1");
				Группировка3 = Макет.ПолучитьОбласть("Группировка|Общая2");
				
				Группировка1.Параметры.ЗначениеГруппировки = ПолноеНаименование(Опер.ОсновноеСредство);
				Группировка3.Параметры.ИтогСуммаПоГруппировке = Опер.Амортизация;
				
				ДокументРезультат.Вывести(Группировка1);
				ДокументРезультат.Присоединить(Группировка3);
				
				Опер2 = Опер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока Опер2.Следующий() Цикл
					ОперПоОбъекту = Опер2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ОперПоОбъекту.Следующий() Цикл
						ВывестиСтроку(ОперПоОбъекту, ДокументРезультат, Макет);
					КонецЦикла;
				КонецЦикла;
				
			Иначе	
				
				ОперПоОбъекту = Опер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ОперПоОбъекту.Следующий() Цикл
					ВывестиСтроку(ОперПоОбъекту, ДокументРезультат, Макет);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	
	
	// Подвал
	Если ГруппироватьПоОбъектам Тогда
		Подвал1 = Макет.ПолучитьОбласть("Подвал1|Общая1");
		Подвал2 = Макет.ПолучитьОбласть("Подвал1|Общая2");
		Подвал2.Параметры.ИтогСуммаАмортизации     = ИтогСуммаАмортизации;
		Подвал2.Параметры.СуммаПрямых		= СуммаАмортизацииПрямые;
		Подвал2.Параметры.СуммаКосвенных	= СуммаАмортизацииКосвенные;
		Подвал2.Параметры.СуммаПрочих		= СуммаАмортизациипрочие;
		ДокументРезультат.Вывести(Подвал1);
		ДокументРезультат.Присоединить(Подвал2);

	Иначе
		Подвал = Макет.ПолучитьОбласть("Подвал1");
		Подвал.Параметры.ИтогСуммаАмортизации     = ИтогСуммаАмортизации;
		Подвал.Параметры.СуммаПрямых		= СуммаАмортизацииПрямые;
		Подвал.Параметры.СуммаКосвенных	= СуммаАмортизацииКосвенные;
		Подвал.Параметры.СуммаПрочих		= СуммаАмортизациипрочие;
		ДокументРезультат.Вывести(Подвал);
	КонецЕсли;

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	СтруктураЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаКон);
	ОбластьПодвал.Параметры.ОтветственныйЗаРегистры = ОбщегоНазначения.ФамилияИнициалыФизЛица(СтруктураЛиц.ОтветственныйЗаРегистры);
	ДокументРезультат.Вывести(ОбластьПодвал);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
